package constants

enum class ErrorType(val msg: String) {
    TYPE_ERROR("Невдалось вiрно визначити тип акту. Можливо, через дописи рукою на документi, погану якiсть скану або невiрна дата (перевiрте кiлькiсть днiв у мiсяцi)"),
    DATE_ERROR("Невдалось вiрно визначити дату акту. Можливо, через дописи рукою на документi, погану якiсть скану або невiрна дата (перевiрте кiлькiсть днiв у мiсяцi)"),
    CONTRACT_NUM_ERROR("Невдалось вiрно визначити номер угоди. Можливо, через дописи рукою на документi або погану якiсть скану"),
    REGION_ERROR("Невдалось вiрно визначити номер регiону. Можливо, через дописи рукою на документi або погану якiсть скану")
}